[
  {
    "context": "Director-cum-Principal is Prof. Rajeev Khanduja and his Phone Number is 01907 - 267199. The Deputy Controller is Sh. Nag Singh Yadav, HPFAS and his Phone number is 094181 - 30000.  PA to Director-Cum-Principal is Sh. Som Nath Sharma and his phone number is 01907 - 267199."
  },
  {
    "context": "JNGEC was established in 2006 and is located in Sundernagar, Himachal Pradesh, India. It is affiliated with Himachal Pradesh Technical University (HPTU). The college offers undergraduate and postgraduate programs in various engineering disciplines."
  },
  {
    "context": "The cources offered by the college are Mechanical, Electronics and Communication, Computer science, Textile and Civil Engineering."
  },
  {
    "context": "ADMISSION PROCEDURE 2023-2027  1. Show your admission letter and collect student admission file (available at the reception of Jawaharlal Nehru Govt. Engg. College, Sundernagar (HP).  2. Attach the following documents in original/self attested photocopy in the admission file as per the given order:  (i) Student Identification Form (to be filled by candidate).  (ii) Admission Letter issued by HPTU.  (iii) JEE/HPCET/Score Card.  (iv) Matriculation Certificate.  (v) 10+2 Marks Sheet.  (vi) Original Character Certificate. (if NOT submitted at HPTU Hamirpur)  (vii) Bonafide Certificate.  (viii) Category Certificate.     (if applicable)  (ix) Physically Handicapped Certificate.   (if applicable)  (x) Income Certificate (TFW).    (if applicable)  (xi) Original Gap Certificate/Affidavit (If NOT submitted at HPTU Hamirpur)  (xii) Original Migration Certificate (If NOT submitted at HPTU Hamirpur)  (xiii) Medical Fitness Certificate  (xiv) Bank Account Copy (issued on student's name)  (xv) Aadhar Card copy.  (XVI) 02 Nos. of passport size photographs  3. Submit the file back to the admission committee along with an extra set of self attested photocopy of above applicable documents.  4. Deposit the college fee.  5. Finally attach the fee receipt (College copy) in the file available at the admission committee desk."
  },
  {
    "context": "(1) Admission letter from HPTIJ.  (2) JEE/ HPCET Score Card.  (3) Matriculation Certificate.  (4) 10+2 Marks Sheet.  (5) Character Certificate.  (6) Bonafide Certificate.  (7) Category Certificate.  (8) Physically Handicapped Certificate.  (9) Income Certificate (TFW).  (10) Certificate/Affidavit  (11) Medical Certificate  (12) Aadhar Card  (13) Migration Certificate"
  },
  {
    "context": "Registration of all students for all programmes (UG & PG) except 1st Year will be held from 15.07.2025 to 17.07.2025."
  },
  {
    "context": "As per office order no GEC/SNR/Estt2023-1222-23 dated 15/03/2023, list of faculty counsellors of Electonics and Communication department are mentioned for your kind consideration   - l. Ankit Sharma for 4th Year, Akshay Kanwar for 3rd Year and  Rita Devi for 2nd Year"
  },
  {
    "context": "The list of faculty advisor/counsellor /class in-charge of 1 year for session February-June, 2023 is as follows: ME/2nd is Dr Sunita Thakur, CE/2nd Dr Ajnesh Singh , ECE/2nd Dr Parul Chauhan, TE/2nd Dr Neelam Guleria and CSE/2nd Mrs. Rita Rana"
  },
  {
    "context": "Commencement of Classes of these programmes begins on 16.07.2025."
  },
  {
    "context": "1st Periodical Exams (Mid Sem. Tests I) will be conducted from 09.09.2025 to 12.09.2025."
  },
  {
    "context": "HPTU Sports Meet will be held from 05.10.2025 to 07.10.2025."
  },
  {
    "context": "2nd Periodical Exams (Mid Sem. Tests II) will be held from 13.10.2025 to 16.10.2025."
  },
  {
    "context": "Diwali vacations are scheduled for 6 days from 17.10.2025 to 22.10.2025."
  },
  {
    "context": "End of teaching work for odd semester is on 22.11.2025."
  },
  {
    "context": "Reporting of shortage of attendance cases & display of internal assessment is scheduled on 26.11.2025."
  },
  {
    "context": "End Semester Practical Examination is scheduled from 27.11.2025 to 30.11.2025."
  },
  {
    "context": "End Semester Theory Examinations will be held from 03.12.2025 to 25.12.2025."
  },
  {
    "context": "Winter Vacation will be from 27.12.2025 to 18.01.2026 (23 days)."
  },
  {
    "context": "Registration for all programmes (UG & PG) for even semester is from 19.01.2026 to 21.01.2026."
  },
  {
    "context": "Classes for even semester start on 20.01.2026."
  },
  {
    "context": "Classes for odd semester start on 16.07.2025."
  },
  {
    "context": "Four months’ Industrial training/Project based work for B.Tech. 8th semester is from 20.01.2026 to 16.05.2026."
  },
  {
    "context": "1st Periodical Exams (Mid Sem. Tests I) for even semester will be from 25.02.2026 to 28.02.2026."
  },
  {
    "context": "HPTU Youth Festival will be held from 06.03.2026 to 08.03.2026."
  },
  {
    "context": "Reporting of shortage of attendance cases and internal assessment will be done on 23.05.2026."
  },
  {
    "context": "End Semester Practical Exams are from 25.05.2026 to 28.05.2026."
  },
  {
    "context": "End Semester Theory Exams are scheduled from 29.05.2026 to 15.06.2026."
  },
  {
    "context": "Final Viva Voce of B.Tech. 8th Semester students and submission of final awards is on 30.05.2025."
  },
  {
    "context": "Industrial/institutional training of students (wherever applicable) is from 16.06.2026 to 27.07.2026 (4 to 6 weeks)."
  },
  {
    "context": "Summer Vacation for even semester is from 18.06.2026 to 16.07.2026 (29 days)."
  },
  {
    "context": "The fee deposit window for 3rd, 5th, 7th Semesters of B.Tech and 3rd Semester M.Tech Civil Engg. (Odd Semester) is from 08.07.2025 to 15.07.2025."
  },
  {
    "context": "The fee for 5th Semester Lateral Entry students is ₹28,570 for boys and ₹13,570 for girls, PH & TFW category."
  },
  {
    "context": "The hosteller’s fee for 3rd, 5th, and 7th Semester B.Tech students is ₹31,720 for boys and ₹16,720 for PH & TFW category."
  },
  {
    "context": "The fee for 3rd Semester M.Tech Civil Engg. is ₹53,570 for boys and ₹23,570 for girls/PH/TFW."
  },
  {
    "context": "Students must pay their fees online through the official website www.jngec.ac.in by clicking on the 'Fee Deposit Link'."
  },
  {
    "context": "The payment gateway requires using the saving account of HPSCo-Op Bank EC-JNGEC SNR, UPI, Google Pay, or Phone Pay. No other payment modes are acceptable."
  },
  {
    "context": "Students with study loans can deposit their fee via bank draft on or before 12.07.2025. Drafts must be made in favor of Director-Cum-Principal, J.N. Govt. Engg. College Sundernagar."
  },
  {
    "context": "Hi! I'm your friendly assistant, here to help you with your queries."
  },
  {
    "context": "I'm functioning perfectly, thank you for asking!"
  },
  {
    "context": "My name is JNGEC Assistant, created by Sankhyan to assist you with information and tasks."
  },
  {
    "context": "My purpose is to assist you with any questions or tasks you have related to JNGEC or general queries."
  },
  {
    "context": "Yes, I can help you with any information or tasks you need assistance with."
  },
  {
    "context": "JNGEC stands for Jawaharlal Nehru Government Engineering College, located in Sundernagar, Himachal Pradesh, India. It was established in 2006 and is affiliated with Himachal Pradesh Technical University (HPTU)."
  },
  {
    "context": "I was created by Sankhyan to assist you with information and tasks."
  },
  {
    "context": "My function is to assist you with any questions or tasks you have related to JNGEC or general queries."
  },
  {
    "context": "Yes, I can answer your questions to the best of my ability."
  },
  {
    "context": "My role is to assist you with any information or tasks you need help with, especially related to JNGEC."
  },
  {
    "context": "Yes, I am a chatbot designed to assist you with your queries."
  },
  {
    "context": "Yes, I can help you with your homework. Just let me know what you need assistance with!"
  },
  {
    "context": "I'm not equipped to provide real-time weather updates, but you can check a reliable weather website or app for the latest information."
  },
  {
    "context": "Sure! Why don't scientists trust atoms? Because they make up everything!"
  },
  {
    "context": "I don't have personal preferences, but I can help you find information about colors or their meanings."
  },
  {
    "context": "I don't eat, but I can provide recipes or information about different cuisines if you're interested."
  },
  {
    "context": "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3000 years old and still edible!"
  },
  {
    "context": "I don't watch movies, but I can recommend popular films or provide information about them if you're interested."
  },
  {
    "context": "Yes, I can help you with your project. Just let me know what you need assistance with!"
  },
  {
    "context": "I don't read books, but I can suggest popular titles or provide summaries if you're interested."
  },
  {
    "context": "JNGEC stands for Jawaharlal Nehru Government Engineering College, located in Sundernagar, Himachal Pradesh, India. It was established in 2006 and is affiliated with Himachal Pradesh Technical University (HPTU). The college offers undergraduate and postgraduate programs in various engineering disciplines."
  },
  {
    "context": "Yes, I'm an AI developed by Sankhyan to assist you with information and tasks."
  },
  {
    "context": "Hello! How can I assist you today?"
  },
  {
    "context": "Namaste, How Can I help You?"
  },
  {
    "context": "Hi there! I'm here to help you with any questions or tasks you have."
  },
  {
    "context": "I'm here to assist you with any queries you have about JNGEC or related topics."
  },
  {
    "context": "My purpose is to assist you with any questions or tasks you have related to JNGEC or general queries."
  },
  {
    "context": "I'm here to assist you with any queries you have about JNGEC or related topics."
  },
  {
    "context": "My name is JNGEC Assistant, created by Sankhyan to assist you with information and tasks."
  },
  {
    "context": "Yes, I can help you with any information or tasks you need assistance with."
  },
  {
    "context": "My function is to assist you with any questions or tasks you have related to JNGEC or general queries."
  },
  {
    "context": "Yes, I can answer your questions to the best of my ability."
  },
  {
    "context": "My role is to assist you with any information or tasks you need help with, especially related to JNGEC."
  },
  {
    "context": "Yes, I am a chatbot designed to assist you with your queries."
  },
  {
    "context": "Yes, I can help you with your homework. Just let me know what you need assistance with!"
  },
  {
    "context": "I'm not equipped to provide real-time weather updates, but you can check a reliable weather website or app for the latest information."
  },
  {
    "context": "Sure! Why don't scientists trust atoms? Because they make up everything!"
  },
  {
    "context": "I don't have personal preferences, but I can help you find information about colors or their meanings."
  },
  {
    "context": "I don't eat, but I can provide recipes or information about different cuisines if you're interested."
  },
  {
    "context": "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3000 years old and still edible!"
  },
  {
    "context": "I don't watch movies, but I can recommend popular films or provide information about them if you're interested."
  },
  {
    "context": "I'm here to help you with any questions or tasks you have. Just let me know what you need assistance with!"
  },
  {
    "context": "Good morning! I hope you have a productive day ahead."
  },
  {
    "context": "Good afternoon! If you have any questions, feel free to ask."
  },
  {
    "context": "Good evening! Let me know if you need any help."
  },
  {
    "context": "I'm here to help you 24/7 with any questions you might have."
  },
  {
    "context": "I'm a chatbot designed to answer your questions and assist you in any way I can."
  },
  {
    "context": "I can provide information, answer questions, and assist with various tasks."
  },
  {
    "context": "I'm here to assist you with any queries you have about JNGEC or related topics."
  },
  {
    "context": "The Jawaharlal Nehru Government Engineering College (JNGEC) is an engineering college located in Sundernagar, Himachal Pradesh, India. It was established in 2006 and is affiliated with Himachal Pradesh Technical University (HPTU). The college offers undergraduate and postgraduate programs in various engineering disciplines."
  },
  {
    "context": "सर्वार्थ साधकम is the Motto of JNGEC"
  },
  {
    "context": "The name of the College is Jawaharlal Nehru Government Engineering College, Sundernagar (JNGEC) and it is located in Sundernagar, Himachal Pradesh, India."
  },
  {
    "context": "Director-cum-Principal is Prof. Rajeev Khanduja and his Phone Number is 01907 - 267199. The Deputy Controller is Sh. Nag Singh Yadav, HPFAS and his Phone number is 094181 - 30000.  PA to Director-Cum-Principal is Sh. Som Nath Sharma and his phone number is 01907 - 267199."
  },
  {
    "context": "The college was established in 2006 and is affiliated with Himachal Pradesh Technical University (HPTU)."
  },
  {
    "context": "The college offers undergraduate and postgraduate programs in various engineering disciplines."
  },
  {
    "context": "The college is located in Sundernagar, Himachal Pradesh, India."
  },
  {
    "context": "The college has a central library that was set up in 2006 and shifted to the college campus in 2011."
  },
  {
    "context": "The library is situated in Administrative Block A and comprises three floors with a seating capacity of 300 readers."
  },
  {
    "context": "The library is strengthened with RFID technology for efficient book management and tracking."
  },
  {
    "context": "All faculty, staff, and students of the college have been issued RFID-enabled ID cards to use the library facility."
  },
  {
    "context": "The library collection includes 14013 books, 3215 titles, 42 journals, 20 magazines, and 7 newspapers."
  },
  {
    "context": "The library provides seating for 300 people, a photostat facility, and 20 computers in the e-library with Wi-Fi access."
  },
  {
    "context": "The library is affiliated with the National Digital Library (NDL) and Developing Library Network (DELNET)."
  },
  {
    "context": "The library is open from 9:00 AM to 5:00 PM."
  },
  {
    "context": "Borrowing privileges are available to faculty, visiting faculty, research scholars, staff, and students registered in the library."
  },
  {
    "context": "Students can borrow up to three books at a time, and reference books, textbooks, unbound journals, periodicals, newspapers, and technical reports are not issued out of the library."
  },
  {
    "context": "Issued books can be renewed online for a period of 15 days, subject to a maximum of three times."
  },
  {
    "context": "Overdue charges are Rs.1 per document per day for student members."
  },
  {
    "context": "Superitendent Grade-I is Smt. Chander Kanta her Phone Number is 01907 - 267688 . Dean (Academics) is Dr. Ritesh Koundal and his Phone Number is 01907 - 266811. Dean (Student Welfare) is  Prof Rajeev Khanduja and his Phone number is 01907 - 267632 . Training & Placement Officer is Sh. Anil Kanwar and his Phone numberd is 01907 - 266728"
  },
  {
    "context": "Prof Rajeev Khanduja's Contact Details - Office: Director's Office Block-A, Tel no: 01907 267199,Email: jngechp@yahoo"
  },
  {
    "context": "Smt. Chander Kanta's Contact Details - Office: Administrative Block-A, Tel no: 01907 267688, Email: jngechp@yahoo"
  },
  {
    "context": "Dr. Ritesh Koundal's Contact Details - Office: Academic Block-B, Tel no: 01907 266811, Email: jngechp@yahoo"
  },
  {
    "context": "Sh Anil Kanwar's Contact Details - Office: Training & Placement Cell, Tel no: 01907 266728, Email: jngechp@yahoo"
  },
  {
    "context": "The central library at Jawaharlal Nehru Government Engineering College, Sundernagar (JNGEC) was set up in the year 2006 in the campus of Govt Polytechnic library Sundernagar | The library was shifted to the college campus in the year 2011 | The library is situated in Administrative Block A and comprises the three floors of the block | The library has got the seating capacity of 300 readers | The library is strengthened with RFID technology and books are being issued/returned with this facility | All faculty, staff and students of this college have been issued RFID enabled ID cards to use the library facility"
  },
  {
    "context": "All faculty, staff and students of this college have been issued RFID enabled ID cards to use the library facility"
  },
  {
    "context": "The library is situated in Administrative Block A and comprises the three floors of the block | The library has got the seating capacity of 300 readers | The library is strengthened with RFID technology and books are being issued/returned with this facility"
  },
  {
    "context": "The library has got the seating capacity of 300 readers | The library is strengthened with RFID technology and books are being issued/returned with this facility"
  },
  {
    "context": "The library is situated in Administrative Block A and comprises the three floors of the block | The library has got the seating capacity of 300 readers | The library is strengthened with RFID technology and books are being issued/returned with this facility | All faculty, staff and students of this college have been issued RFID enabled ID cards to use the library facility"
  },
  {
    "context": "The library is situated in Administrative Block A and comprises the three floors of the block | The library has got the seating capacity of 300 readers | The library is strengthened with RFID technology and books are being issued/returned with this facility | All faculty, staff and students of this college have been issued RFID enabled ID cards to use the library facility"
  },
  {
    "context": "The library staff includes Mrs Anita Jaswal (Librarian, Phone Number: 01907 - 267199), Smt. Vaijanti Mala (Instructor MOP), Smt. Pushpa Yadav (Clerk), and Smt. Kaushlya Devi (Peon)."
  },
  {
    "context": "The library collection includes 14013 books, 3215 titles, 42 journals, 20 magazines, 7 newspapers, seating capacity for 300 people, 1 photostat facility, 20 computers in the e-library, and Wi-Fi facility."
  },
  {
    "context": "| Membership of National Digital Library (NDL) and Developing Library Network (DELNET) | Timings The Central Library shall be open from 9:AM to 5:PM"
  },
  {
    "context": "Membership of National Digital Library (NDL) and Developing Library Network (DELNET). The Central Library shall be open from 9:00 AM to 5:00 PM."
  },
  {
    "context": "Borrowing privileges are given only to the Faculty, Visiting Faculty, Research Scholars, Staff, and Students who are registered in the library. Books can be issued to the borrowers only against the Institute ID Card. Students can borrow/issue only three books at a time. Reference books, textbooks, unbound issues of journals, periodicals, newspapers, and technical reports are not issued out of the library to anybody. Books and materials kept in the Reserve Section (textbooks) are issued only for 2 hours. Such books have to be reissued after the stipulated time."
  },
  {
    "context": "An issued book can be renewed online for a period of 15 days, subject to a maximum of 3 times. If the online renewal limit is reached, then the book has to be physically brought to the library for renewal. If the book has been reserved by any other person, then the book cannot be renewed."
  },
  {
    "context": "The members should return library books on or before the due date, failing which overdue charges of Rs 1 per document per day will be charged from the student members. On late return of the restricted reading material issued for overnight, the fine of Rs 1/- per hour per volume and maximum up to Rs 5/- per volume per day will be charged."
  },
  {
    "context": "Readers and visitors are required to leave their personal books, handbags, briefcases, etc., at the reception near the entrance of the library. All Library staff shall have no responsibility for personal belongings in the Library. The readers shall maintain perfect order and silence in the library. Making noise, spitting, smoking, and visiting the library in an intoxicated condition is strictly prohibited in the library. A reader will be responsible for any damage caused to the library property or reading material. The member has to replace the damaged material/property and also has to pay the penalty imposed in such cases. Students/members will vacate their seats ten minutes before the close of the library. The Librarian reserves the right to suspend/cancel the membership of any member found misbehaving with the library staff or for any other indecent behavior. The Librarian can recall any book from any member at any time. The membership of students will be valid for one academic session and cards will be renewed in the even semester. No book shall be issued for loan, which the Librarian feels is not in a condition to be safely handled by the borrower. In case any book becomes overdue for more than 14 days, no further books will be issued unless such book is returned. The library will not be responsible for members' personal belongings/property lost in the library. The members are required to switch off their mobiles while entering the library. The library rules may be altered or amended, or new rules may be added to the existing ones from time to time without any notice to the members, and these will be binding upon the members. The entry in the library will be allowed with a library card only. All the users are required to switch off their mobiles or keep them on vibration mode. Users should not enter places that are only for library staff. The Librarian, normally in consultation with the Library Committee, has the authority to prescribe, alter, and amend as necessary, specific regulations concerning the use of the Library."
  },
  {
    "context": "The library is equipped with RFID technology for efficient book management and tracking. RFID-enabled ID cards are issued to all faculty, staff, and students for easy access to library services."
  },
  {
    "context": "The library has a collection of 14013 books, 3215 titles, 42 journals, 20 magazines, and 7 newspapers. It also provides seating for 300 people, a photostat facility, and 20 computers in the e-library with Wi-Fi access."
  },
  {
    "context": "The library is open from 9:00 AM to 5:00 PM and is affiliated with the National Digital Library (NDL) and Developing Library Network (DELNET)."
  },
  {
    "context": "Borrowing privileges are available to faculty, visiting faculty, research scholars, staff, and students registered in the library. Students can borrow up to three books at a time, and reference books, textbooks, unbound journals, periodicals, newspapers, and technical reports are not issued out of the library."
  },
  {
    "context": "Issued books can be renewed online for 15 days, up to a maximum of 3 times. After that, the book must be physically brought to the library for renewal. If the book has been reserved by another person, it cannot be renewed."
  },
  {
    "context": "Overdue charges are Rs 1 per document per day for student members. For restricted reading material issued overnight, the fine is Rs 1 per hour per volume, up to a maximum of Rs 5 per volume per day."
  },
  {
    "context": "Readers must leave personal belongings at the reception. Library staff are not responsible for personal items. Silence must be maintained. Noise, spitting, smoking, and intoxication are prohibited. Members are responsible for damages and must replace damaged items and pay penalties. Seats must be vacated ten minutes before closing. Misbehavior can lead to suspension of membership. The Librarian can recall books anytime. Membership is valid for one academic session and renewed in the even semester. Books in poor condition will not be issued. Overdue books for more than 14 days prevent further borrowing. Mobile phones must be switched off or kept on vibration mode. Entry requires a library card."
  },
  {
    "context": "The central library at Jawaharlal Nehru Government Engineering College, Sundernagar (JNGEC) was set up in the year 2006 in the campus of Govt Polytechnic library Sundernagar."
  },
  {
    "context": "The library was shifted to the college campus in the year 2011."
  },
  {
    "context": "The library is situated in Administrative Block A and comprises the three floors of the block."
  },
  {
    "context": "The library has got the seating capacity of 300 readers."
  },
  {
    "context": "The library is strengthened with RFID technology and books are being issued/returned with this facility."
  },
  {
    "context": "All faculty, staff and students of this college have been issued RFID enabled ID cards to use the library facility."
  },
  {
    "context": "Smart classrooms are Technology Enhanced classrooms that integrate the learning with latest technological tools. Such classrooms enhance the quality of teaching."
  },
  {
    "context": "To provide best quality education using latest technology, the institute has taken the initiative in this direction."
  },
  {
    "context": "The task of development of smart classroom is completed."
  },
  {
    "context": "The advent of Information and Communication Technology has had a profound and commanding global influence on the matrix of socio-economic and educational activities the world over in new era."
  },
  {
    "context": "Industrial and developed countries are well-ahead in formulating policies and programmes to accelerate its development, diffusion and empowerment abilities."
  },
  {
    "context": "Developing countries like India, having sensed it, follow at a breakneck velocity for establishing and capitalizing on the enabling capabilities of Information and Communication Technology in the field of Education."
  },
  {
    "context": "Technology was very ancient to India which gave to the world the binary system on which modern education and computer systems are based."
  },
  {
    "context": "Learning and dissemination of information is becoming more important than ever."
  },
  {
    "context": "Internet based education and e-Learning are the trends of the day."
  },
  {
    "context": "Looking at India's attempts to harness the broadcast technologies, one comes across a kaleidoscope of activities."
  },
  {
    "context": "The library is strengthened with RFID technology and books are being issued/returned with this facility."
  },
  {
    "context": "All faculty, staff and students of this college have been issued RFID enabled ID cards to use the library facility."
  },
  {
    "context": "Smart classrooms are Technology Enhanced classrooms that integrate the learning with latest technological tools. Such classrooms enhance the quality of teaching."
  },
  {
    "context": "To provide best quality education using latest technology, the institute has taken the initiative in this direction."
  },
  {
    "context": "The task of development of smart classroom is completed."
  },
  {
    "context": "The advent of Information and Communication Technology has had a profound and commanding global influence on the matrix of socio-economic and educational activities the world over in new era."
  },
  {
    "context": "Industrial and developed countries are well-ahead in formulating policies and programmes to accelerate its development, diffusion and empowerment abilities."
  },
  {
    "context": "Developing countries like India, having sensed it, follow at a breakneck velocity for establishing and capitalizing on the enabling capabilities of Information and Communication Technology in the field of Education."
  },
  {
    "context": "India is perhaps the only country with a satellite completely dedicated to education, the EDUSAT."
  },
  {
    "context": "India has developed educational broadcast channels such as the Gyan Darshan Network and dedicated satellites such as EDUSAT for audio, video and data transmission and interactivity."
  },
  {
    "context": "India has 17 Education Multimedia Research centres and coordination centre Consortium of Educational Communication which helped building considerable knowledge resources over a period of 20 years."
  },
  {
    "context": "The advent of Information and Communication Technology has had a profound and commanding global influence on the matrix of socio-economic and educational activities the world over in new era."
  },
  {
    "context": "Industrial and developed countries are well-ahead in formulating policies and programmes to accelerate its development, diffusion and empowerment abilities."
  },
  {
    "context": "Developing countries like India, having sensed it, follow at a breakneck velocity for establishing and capitalizing on the enabling capabilities of Information and Communication Technology in the field of Education."
  },
  {
    "context": "Technology was very ancient to India which gave to the world the binary system on which modern education and computer systems are based."
  },
  {
    "context": "Learning and dissemination of information is becoming more important than ever."
  },
  {
    "context": "Internet based education and e-Learning are the trends of the day."
  },
  {
    "context": "Looking at India's attempts to harness the broadcast technologies, one comes across a kaleidoscope of activities."
  },
  {
    "context": "India is perhaps the only country with a satellite completely dedicated to education, the EDUSAT."
  },
  {
    "context": "India has developed educational broadcast channels such as the Gyan Darshan Network and dedicated satellites such as EDUSAT for audio, video and data transmission and interactivity."
  },
  {
    "context": "India has 17 Education Multimedia Research centres and coordination centre Consortium of Educational Communication which helped building considerable knowledge resources over a period of 20 years."
  },
  {
    "context": "Internet based education and e-Learning are the trends of the day."
  },
  {
    "context": "Looking at India's attempts to harness the broadcast technologies, one comes across a kaleidoscope of activities."
  },
  {
    "context": "India is perhaps the only country with a satellite completely dedicated to education, the EDUSAT."
  },
  {
    "context": "India has developed educational broadcast channels such as the Gyan Darshan Network and dedicated satellites such as EDUSAT for audio, video and data transmission and interactivity."
  },
  {
    "context": "India has 17 Education Multimedia Research centres and coordination centre Consortium of Educational Communication which helped building considerable knowledge resources over a period of 20 years."
  },
  {
    "context": "The Computer Centre is a central facility, which caters the needs of all four disciplines and various sections of the institute."
  },
  {
    "context": "Computer Centre Established in 2010, JNGEC Computer Centre serves the college as its central computing facility and the nodal centre for computer activities on the campus."
  },
  {
    "context": "Computer Centre is entrusted with the responsibility of promoting the IT infrastructure, Network and Automation in the college."
  },
  {
    "context": "Function The Centre supports and coordinates computer usage by Graduate students, faculties and staff of various departments."
  },
  {
    "context": "The centre provides guidance, support and services to the faculties and staff of various departments and academic institutions in performing statistical analysis for their work."
  },
  {
    "context": "The department is involved in conducting various activities like workshops, Web development trainings etc."
  },
  {
    "context": "The Computer Centre is encouraging the use of open source software's."
  },
  {
    "context": "Currently the Centre is equipped with with latest configuration dual boot computer systems loaded with relevant software systems."
  },
  {
    "context": "Student works with Windows and Linux based computer systems."
  },
  {
    "context": "| Sr No | Name of equipment with make | Quantity | |---|---|---| | 1 | Acer Computers | 20 | | 2 | Lenovo | 14 | | Total computers in computer centre | 80 |"
  },
  {
    "context": "Computer Center Established in 2010, JNGEC Computer Centre serves the college as its central computing facility and the nodal centre for computer activities on the campus."
  },
  {
    "context": "Computer Centre is entrusted with the responsibility of promoting the IT infrastructure, Network and Automation in the college."
  },
  {
    "context": "Computer Centre is a central facility, which caters the needs of all four disciplines and various sections of the institute."
  },
  {
    "context": "Function The Centre supports and coordinates computer usage by Graduate students, faculties and staff of various departments."
  },
  {
    "context": "The centre provides guidance, support and services to the faculties and staff of various departments and academic institutions in performing statistical analysis for their work."
  },
  {
    "context": "The department is involved in conducting various activities like workshops, Web development trainings etc."
  },
  {
    "context": "The Computer Centre is encouraging the use of open source software's."
  },
  {
    "context": "Infrastructure Currently the Centre is equipped with with latest configuration dual boot computer systems loaded with relevant software systems."
  },
  {
    "context": "Student works with Windows and Linux based computer systems."
  },
  {
    "context": "Computing nodes are well connected with 100 mbps high speed internet connectivity."
  },
  {
    "context": "This Centre is well equipped with the latest configuration Computer systems with Network printer and relevant software's."
  },
  {
    "context": "All the Blocks are connected with Wi-Fi Networks."
  },
  {
    "context": "Computer Centre and Central server systems with 100 Mbps NKN Connectivity with a capacity of 80 students had been catering to the needs of various stakeholders of this institute."
  },
  {
    "context": "| Sr No | Name of equipment with make | Quantity | |---|---|---| | 1 | Acer Computers | 20 | | 2 | Lenovo | 14 | | Total computers in computer centre | 80 |"
  },
  {
    "context": "The Computer Centre is equipped with the latest configuration dual boot computer systems loaded with relevant software systems."
  },
  {
    "context": "The Computer Centre is encouraging the use of open source software's."
  },
  {
    "context": "The Computer Centre is involved in conducting various activities like workshops, Web development trainings etc."
  },
  {
    "context": "The centre provides guidance, support and services to the faculties and staff of various departments and academic institutions in performing statistical analysis for their work."
  },
  {
    "context": "Function The Centre supports and coordinates computer usage by Graduate students, faculties and staff of various departments."
  },
  {
    "context": "Computer Centre is entrusted with the responsibility of promoting the IT infrastructure, Network and Automation in the college."
  },
  {
    "context": "Computer Centre Established in 2010, JNGEC Computer Centre serves the college as its central computing facility and the nodal centre for computer activities on the campus."
  },
  {
    "context": "The Computer Centre is a central facility, which caters the needs of all four disciplines and various sections of the institute."
  },
  {
    "context": "The Computer Centre is equipped with the latest configuration dual boot computer systems loaded with relevant software systems."
  },
  {
    "context": "Student works with Windows and Linux based computer systems."
  },
  {
    "context": "Computing nodes are well connected with 100 mbps high speed internet connectivity."
  },
  {
    "context": "This Centre is well equipped with the latest configuration Computer systems with Network printer and relevant software's."
  },
  {
    "context": "All the Blocks are connected with Wi-Fi Networks."
  },
  {
    "context": "Computer Centre and Central server systems with 100 Mbps NKN Connectivity with a capacity of 80 students had been catering to the needs of various stakeholders of this institute."
  },
  {
    "context": "Conference Hall The college has the conference hall with the capacity of 300 participants."
  },
  {
    "context": "The conference hall is located in second floor of Administrative block 'A' of the institute."
  },
  {
    "context": "The conference hall has ultra modern infrastructure with high quality sound system."
  },
  {
    "context": "The conference hall is planned to be provided the high speed internet connectivity and video cameras to make two way on-line communication possible with remote nodes."
  },
  {
    "context": "Canteen The college canteen is a spacious food joint newly constructed for the purpose of serving wholesome, nutritious food to the JNGECians."
  },
  {
    "context": "The canteen is situated in the D-block ground floor and remains open from 9."
  },
  {
    "context": "A wide variety of Indian snacks and dishes are available."
  },
  {
    "context": "During lunch time, meals are available at very reasonable prices."
  },
  {
    "context": "The canteen besides being hygienic also provides swift service."
  },
  {
    "context": "The ever-busy canteen bustling with inquisitive minds is a recreational -cum-hangout place for the members of JNGEC family."
  },
  {
    "context": "Guest House The institute has well furnished guest house catering to the needs of guests of the institute."
  },
  {
    "context": "The institute has TWO guest rooms."
  },
  {
    "context": "Guest house is at top floor of Block C."
  },
  {
    "context": "Each guest room has attached wash-room."
  },
  {
    "context": "To book the guest house while on visit to the institute, please fill the Performa available on the college website and submit to the care taker of the guest house."
  },
  {
    "context": "The guest house charge list per day will be mentioned on the performa and also mentioned in the link."
  },
  {
    "context": "Guest house booking form: Download Guest house charges list: Download Guest house operational manual: Download."
  },
  {
    "context": "The college is located at Sundernagar, District Mandi, Himachal Pradesh, India. The nearest railway station is Jogindernagar which is 80 Kms away and the nearest airport is Bhuntar (Kullu) which is 75 Kms away. The college is well connected by road with Chandigarh and Delhi. The distance from Chandigarh to Sundernagar is 164 Kms and from Delhi to Sundernagar is 400 Kms."
  },
  {
    "context": "The college is well connected by road with Chandigarh and Delhi. The distance from Chandigarh to Sundernagar is 164 Kms and from Delhi to Sundernagar is 400 Kms."
  },
  {
    "context": "The college has a well-equipped library with a vast collection of books, journals, and digital resources."
  },
  {
    "context": "The library provides access to various online databases and e-books for students and faculty."
  },
  {
    "context": "The library has a reading room where students can study in a quiet environment."
  },
  {
    "context": "The library organizes regular workshops on research skills and information literacy."
  },
  {
    "context": "The library is open from 9 AM to 5 PM on weekdays and from 10 AM to 2 PM on Saturdays."
  },
  {
    "context": "Boy's Hostel A Boy's Hostel is a residential facility specifically designed to offer safe, comfortable, and convenient accommodation for male students."
  },
  {
    "context": "The hostel is located within colleges campus."
  },
  {
    "context": "Beyond just a place to sleep, a boy's hostel further promote a sense of community, discipline, and independence among its residents."
  },
  {
    "context": "The department is involved in conducting various activities like workshops, Web development trainings etc."
  },
  {
    "context": "It often includes essential facility such as dining areas, study rooms, recreation spaces, and 24/7 security, all promote to a balanced and focused academic life."
  },
  {
    "context": "Vision: To become renowned textile centre for quality teaching, research and innovation"
  },
  {
    "context": "Mission: To strengthen the core competence in Textile Engineering through balanced and dynamic curriculum"
  },
  {
    "context": "To encourage research and development in emerging areas of Textile Engineering and promote institute-institute and industry-institute linkages"
  },
  {
    "context": "Four students for Textile Engineering got placed in Reliance Industries Limited, Mumbai"
  },
  {
    "context": "Vision: To become a center of excellence, providing quality education & research for civil engineers with ethical standings for socio-economic and sustainable development of the nation"
  },
  {
    "context": "Seven final-year BTech Civil Engineering students (Batch 2021-2025): Mr Archit, Mr Sunit Dutt, Mr Paras, Ms Isha, Mr Rohit, Mr Vikas Kumar Kashyap, Mr Harender Kumar have successfully qualified GATE 2025"
  },
  {
    "context": "Vision: To be in the frontier of Computer Science and Engineering especially in Artificial Intelligence and Machine Learning field and to produce globally competent graduates with moral values committed to build a vibrant nation"
  },
  {
    "context": "To produce successful graduates with personal and professional responsibilities and commitment to lifelong learning"
  },
  {
    "context": "Vision: To impart globally relevant education which inspires the mechanical engineering graduates to innovate, be socially responsive and to develop adaptive solutions for the needs of the industry and society"
  },
  {
    "context": "The Workshop consisting of Fitting Shop, Welding shop, Carpentry shop, Power Tools shop, Foundry Shop, Machine Shop"
  },
  {
    "context": "Vision: To be a premier institution imparting value-based education enabling innovation in frontier areas of technology that propels development of society at national and global arena"
  },
  {
    "context": "Mission: To create an environment that enables creativity, research, and innovation in engineering and technology"
  },
  {
    "context": "To impart value-based education that creates leaders in engineering for the upliftment of society at large"
  },
  {
    "context": "To strive for continuous improvement in imparting technical education"
  },
  {
    "context": "To have a liaison with lead institutions and industries"
  },
  {
    "context": "To promote research and development in emerging areas of technology"
  },
  {
    "context": "To encourage entrepreneurship and innovation among students"
  },
  {
    "context": "To foster a culture of lifelong learning and professional development"
  },
  {
    "context": "To promote ethical values and social responsibility among students"
  },
  {
    "context": "To create a conducive environment for holistic development of students"
  },
  {
    "context": "To collaborate with national and international institutions for academic and research excellence"
  },
  {
    "context": "To contribute to the socio-economic development of the region through technical education"
  },
  {
    "context": "To ensure quality education and continuous improvement in teaching-learning processes"
  },
  {
    "context": "To promote research and development in emerging areas of technology"
  },
  {
    "context": "To encourage entrepreneurship and innovation among students"
  },
  {
    "context": "To foster a culture of lifelong learning and professional development"
  },
  {
    "context": "To promote ethical values and social responsibility among students"
  },
  {
    "context": "To create a conducive environment for holistic development of students"
  },
  {
    "context": "To collaborate with national and international institutions for academic and research excellence"
  },
  {
    "context": "To contribute to the socio-economic development of the region through technical education"
  },
  {
    "context": "To ensure quality education and continuous improvement in teaching-learning processes"
  },
  {
    "context": "To promote research and development in emerging areas of technology"
  },
  {
    "context": "To encourage entrepreneurship and innovation among students"
  },
  {
    "context": "To foster a culture of lifelong learning and professional development"
  },
  {
    "context": "To promote ethical values and social responsibility among students"
  },
  {
    "context": "To create a conducive environment for holistic development of students"
  },
  {
    "context": "To collaborate with national and international institutions for academic and research excellence"
  },
  {
    "context": "To contribute to the socio-economic development of the region through technical education"
  },
  {
    "context": "To ensure quality education and continuous improvement in teaching-learning processes"
  },
  {
    "context": "Jawaharlal Nehru Government Engineering College, Sundernagar (JNGEC) is a AICTE Approved, State Government funded engineering college."
  },
  {
    "context": "It is located at Sundernagar, District Mandi and is affiliated to Himachal Pradesh Technical University (HimTU), Hamirpur."
  },
  {
    "context": "All these Programmes are affiliated to Himachal Pradesh Technical University Hamirpur."
  },
  {
    "context": "The institute campus area comprises of five blocks: administrative block 'A', academic block 'B' & 'C', under construction blocks 'D' and 'E'."
  },
  {
    "context": "The college boasts an ultra-modern, state-of-art campus equipped with all modern facilities and teaching equipment."
  },
  {
    "context": "The college is located in a picturesque location, surrounded by lush green hills and valleys."
  },
  {
    "context": "The college has a well-maintained sports complex with facilities for various indoor and outdoor games."
  },
  {
    "context": "The college has a dedicated placement cell that assists students in securing internships and job placements."
  },
  {
    "context": "The college has a well-equipped workshop for practical training in various engineering disciplines."
  },
  {
    "context": "The college has a dedicated team of faculty members who are highly qualified and experienced in their respective fields."
  },
  {
    "context": "The college has a vibrant student community with various clubs and societies for extracurricular activities."
  },
  {
    "context": "The college has a well-established alumni network that supports current students in their career development."
  },
  {
    "context": "The location of the campus adds to the charm, nested at the top of a hill, surrounded by high mountains."
  },
  {
    "context": "The college has its own guest house catering to the needs of its visitors."
  },
  {
    "context": "The canteen serves faculty, staff, and students during and beyond working hours."
  },
  {
    "context": "The college has a well-equipped library with a vast collection of books, journals, and digital resources."
  },
  {
    "context": "The college has a well-equipped computer centre with high-speed internet connectivity."
  },
  {
    "context": "Vision: To be a premier institution imparting value-based education enabling innovation in frontier areas of technology that propels development of society at national and global arena."
  },
  {
    "context": "To create an environment that enables creativity, research, and innovation in engineering and technology."
  },
  {
    "context": "To strive for continuous improvement in imparting technical education."
  },
  {
    "context": "To provide students with fundamental technical education and skills in mathematics, science, and engineering."
  },
  {
    "context": "To have a liaison with lead institutions and industries to enhance the quality of education and research."
  },
  {
    "context": "To promote research and development in emerging areas of technology."
  },
  {
    "context": "To prepare the students to become successful engineers and managers to meet global industrial requirements."
  },
  {
    "context": "To promote the spirit of entrepreneurship among the students and foster close interaction with industries."
  },
  {
    "context": "The closeness to nature reflects the sustainable and eco-friendly nature of the people of the state and symbolizes the state's desire for a balance between nature and technology."
  },
  {
    "context": "Industrialization solves everything. Infrastructure is key."
  },
  {
    "context": "Course: Civil Engineering, Seats: 60 + 3 (TFWS), Duration: 4 years"
  },
  {
    "context": "Course: Mechanical Engineering, Seats: 60 + 3 (TFWS), Duration: 4 years"
  },
  {
    "context": "Course: Computer Science Engineering (AI & ML), Seats: 60 + 3 (TFWS), Duration: 4 years"
  },
  {
    "context": "Course: Civil Engineering, Duration: 2 years"
  }
]